# -*- coding: utf-8 -*-
"""
Created on Fri Aug 28 18:03:45 2020

@author: peishuo
"""
     #restaurant='炒泰香'
qa_db=[
       {'office':'教務處','group':'註冊組 Registration Section','sort':'註冊 Registration','que':'開學前仍未收到註冊單，如何申請補發？','ans':'若於開學註冊截止日前仍未收到註冊繳費單，可自行登入資訊服務系統補列印繳費單使用，或親至會計室（至善樓12樓）申請補發。\n資訊服務入口網站：https://sso.wzu.edu.tw/Portal/login.htm'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'註冊 Registration','que':'我是五專新生，請問新生基本資料表、住宿申請表這兩張表要在哪裡下載呢？','ans':'「新生基本資料表」與「住宿申請表」皆須由資訊服務入口網登入校務系統，登錄資料後列印，於新生註冊須知均有操作說明。\n資訊服務入口網站：https://sso.wzu.edu.tw/Portal/login.htm'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'註冊 Registration','que':'我是新生，登入資源服務入口網需要學號，那我要怎麼知道學號呢？','ans':'學號查詢請由資訊服務入口網登入頁面查詢。\n資訊服務入口網站：https://sso.wzu.edu.tw/Portal/login.htm'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'註冊 Registration','que':'開學註冊後，何時繳回學生證註記註冊章？','ans':'自105學年度起學生證免蓋註冊章，請學生自行列印學生證正反面影印本並攜帶學生證正本，註冊組查驗後會加蓋"與正本無訛章"或"註冊組單位章"。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'註冊 Registration','que':'如何申請繳費證明？','ans':'如是信用卡或ATM轉帳繳費，可自行登入學校網頁的資訊服務入口網下載列印繳費證明；如是辦理就學貸款，則需親至會計室(至善樓12樓)申請。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學籍變更 Change of Student Status','que':'校友更改學籍資料（姓名、身分證字號或出生年月日）需準備哪些文件？','ans':''}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學籍變更 Change of Student Status','que':'我已經搬家，要更改戶籍地址。我還沒有到戶政機關辦理戶籍更改，但是我想要先更改學校的資料，以方便寄註冊單。請問可以嗎?','ans':'更改戶籍地需檢附戶籍謄本正本及身分證影本，煩請辦理完相關手續再申請更改。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學籍變更 Change of Student Status','que':'在校生更改學籍資料（姓名、身分證字號或出生年月日）需準備哪些文件？','ans':'在校生申請變更上述學籍資料，請備妥下列文件，並填寫「文藻外語大學更改學籍資料申請書」，至註冊組辦理。 \n(1) 身分證影本\n(2) 戶籍謄本正本\n(3) 學生證(如需換照片請備2吋照片1張，背面填寫學號及新姓名)\n(4) 200元（換發新學生證費用）'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學籍變更 Change of Student Status','que':'在校生如何變更資料寄送地址、戶籍地址或監護人姓名？','ans':'在校生如欲變更資料寄送地址、戶籍地址或監護人姓名，請填寫填寫「文藻外語大學更改學籍資料申請書」，並請家長簽名後，交至註冊組辦理，必要時請攜身分證明文件備查。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學籍變更 Change of Student Status','que':'在校生如何更改個人通訊資料或銀行帳號資料？','ans':'在校生如欲變更個人通訊資料（通訊地址、聯絡電話及手機號碼等）或銀行帳號資料，請直接登錄資訊服務系統修改：登入－教務登錄作業－個人通訊資料及銀行帳號維護。\n資訊服務入口網站：https://sso.wzu.edu.tw/Portal/login.htm'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'我看網站上寫「欲英文學位證書影本，需備有正本查驗」若是要郵寄申請的話，如何辦理？','ans':'請把學位證書正本+文件申請表+郵政匯票(抬頭:文藻學校財團法人文藻外語大學)+貼足額回郵信封(B4以上)一同寄至註冊組，待我們處理完成再將資料寄回給您查收。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'遺失學生證如何申請補發？','ans':'學生證遺失如欲申請補發，請至教務處註冊組網頁-掛失數位學生證，再至成績列印自動化繳費系統機申請補發,持申辦聯至註冊組辦理(如欲更換照片請備2吋照片1張，背面填寫學號及姓名)。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'校友如何申請成績單或其他各類證明書？','ans':'校友如欲申請各類證明文件，請攜身分證件親至註冊組填寫「文藻外語大學各類證明文件申請表」，如委託他人代辦，需另附上本人填寫之委託書。\n若以郵寄方式申請，請將下列資料備齊後郵寄至註冊組辦理。\n(1) 各類證明文件申請表(註冊組→表單下載→文件申請→文藻外語大學各類證明文件申請表)\n(2) 文件費用郵政匯票（抬頭：文藻學校財團法人文藻外語大學）\n(3) 足額回郵信封\n其他申請注意事項詳見申請表下方附註說明。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'如何申請成績單或其他證明文件？','ans':'(1)請攜學生證或其他身分證件親至註冊組填寫「文藻外語大學各類證明文件申請表」，如委託他人代辦，需另附上本人填寫之委託書。\n(2)至成績列印自動化繳費系統機申請列印,部份文件申請後需持申辦聯至註冊組臨櫃辦理。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'101學年度以後入學學生如何辦理ISIC國際學生證？','ans':'辦理ISIC國際學生證可透過以下管道申請：\n(1) 「康文文教基金會」網站線上申請。\n(2) 「康文文教基金會」高雄辦事處申請－「鋼友旅行社」（地址：高雄市前金區中華四路282號3樓，電話：07-2158999）。\n(3) 全國各遊學代辦中心皆可代為申請。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'校友學位（畢業）證書遺失，如何申請補發畢業證明書？','ans':'申請補發請備妥下列文件，並填寫「文藻外語大學補發中文學位（畢業）證明書申請書」，至註冊組辦理。\n(1)身分證正反面影印本 \n(2) 處理費200元\n(3) 戶籍謄本正本(若有更改姓名)\n若以郵寄方式申請，請將下列文件備齊後掛號郵寄至註冊組辦理。\n(1) 補發中文學位（畢業）證明書申請書\n(2) 身分證正反面影印本\n(3) 戶籍謄本正本(若有更改姓名)\n(4) 處理費200元郵政匯票（抬頭：文藻學校財團法人文藻外語大學）\n(5) 雙掛號46元大型(B4以上)回郵信封'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'證明文件申請 Application of Documents','que':'如果學生證遺失，但暑假期間急著要用，能不能回學校辦個臨時學生證之類的應急用，或者暑假期間有沒有相關的老師可以幫忙辦理呢？','ans':'暑假期間仍可返校申辦學生證遺失補發，請持身分證明文件於週一至週五上午08:30-12:00；13:10-16:30至教務處註冊組辦理(如欲更換照片請備2吋照片1張，備免填寫學號及姓名)，補發期間可先申請"在學證明書"證明在學生身分。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'輔系、雙主修及學程 Minor,Double Major and Program','que':'請問二技的學生可申請學程嗎？','ans':'自98學年度第1學期可開始申請學程，申請時間請參考行事曆。\n1.請詳閱修讀輔系、雙主修及學程規定與資格，相關辦法公告於課務組網頁/相關法規。\n2.請依公告時間，上網線上申請。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'輔系、雙主修及學程 Minor,Double Major and Program','que':'請問修讀輔系雙主修的學生，必修跟選修的學分是分開算，還是只要加起來有修到規定的學分數就好了，而不需要特別去算必選修各幾學分。','ans':'輔系雙主修應修科目分有必修與選修兩種，需依規定修習方得取得資格，相關資料請參閱課務組網頁科目學分表。\n科目學分表：https://d002.wzu.edu.tw/category/136250'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'輔系、雙主修及學程 Minor,Double Major and Program','que':'請問申請輔系需要的成績單要怎麼向教務處申請？要本人到教務處嗎？','ans':'本人申請以直接到教務處櫃台或者行政大樓2F的機台申請，但如果非本人要在教務處櫃台申請就需要有"委託書"及代理人的身分證件才能申請，或者代理人亦可直接到行政大樓2F的機台申請(但須知道申請人的基本資料)。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學分、成績 Credits, Grades','que':'如果對於期末的成績有疑問的話，請問要怎麼辦呢？','ans':'依「文藻外語大學學生學期成績複查暨申訴處理要點」：學生對其學期成績有疑問者，應即向任課教師複查。如仍有異議，得於收到成績單後至開學一週內，向教務處註冊組填具「學生複查成績申請單」申請複查成績。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'學分、成績 Credits, Grades','que':'我有英文必修課程還沒修過，假如我辦休學，然後在休學期間考托福，成績達到可以抵修免修的分數，那我可以辦復學後直接申請免修嗎？這樣抵完是否就可以領畢業證書？','ans':'日間部四年制大學部學生英文能力檢定測驗托福達六百分；進修部四年制大學部學生英文能力檢定測驗托福達五百六十分，或本校認可之語文檢定測驗成績等同托福標準者，日間部學生可免修三十六學分之共同必修英文，但需選修其他科目補足該學分。\n所以如果您的英檢成績達可以免修，還是要補修其他學分才可以。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'畢業 Graduation','que':'如果因為畢業的時候未通過畢業語言檢定門檻(副修的語言檢定門檻)，所以只拿到肄業證書，假如說之後只要有再考過語檢，是不是隨時都能回學校換畢業證書呢？','ans':'領取肄業（修業）證明書前提須辦理退學手續，退學後則無法再領取學位證書（即畢業證書）。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'畢業 Graduation','que':'如果考上了研究所可是只有領到結業證書，不知道能不能以考上研究所為由， 申請領畢業證書呢？','ans':'依「文藻外語大學學則」第42條：學生修業期滿，修畢各系應修之科目與學分數，學業及操行成績均及格且通過各系訂定之語言能力檢定標準，始得畢業。由本校授予學士學位，並發給學士學位證書。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'畢業 Graduation','que':'請問畢業典禮每班上台授獎的學生，是各班歷年成績排名第一名的學生嗎？ 還是老師另選的品學兼優獎呢？','ans':'文藻外語大學頒發應屆畢業生學業優良獎實施要點\n二、應屆畢業生學業優良獎每班取前一名，頒發獎狀乙幀加以表揚。\n三、應屆畢業生學業優良第一名之核計方式\n1.四年制學生成績以在校前七個學期計算\n2.二年制學生以在校前三個學期計算\n3.五年制學生以在校前九個學期計算\n四、因未修畢所屬系科應修學分或未通過所屬系科訂定之語言能力檢定標準及其它畢業規定，而延長修業年限者，均不列入評比，但因加修輔系、雙主修、教育學程而延長修業者，不在此限；累計排名為全班第一名如因故需延修或非在學身'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'畢業 Graduation','que':'為什麼文藻畢業證書用的紙不是一般獎狀的那種硬紙呢？因為這樣單薄的紙很容易折損，也不像正式的證書。','ans':'本校學位證書用紙是特選材質，有防偽功能的設計，成本也比一般獎狀高很多，建議您妥善存放於畢業證書夾內。'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'其他問題 Other Questions','que':'日間四技部到底怎樣才有可能會被退學？','ans':'依照本校學則第二十二條規定，學生有下列情形之一者，應予退學（各相關單位於退學處分前應告知學生）：\n一、逾期未註冊或休學逾期未復學者，視為無意願就學。\n二、經學生獎懲委員會議決議勒令退學者。\n三、日間部學生學期學業成績不及格科目之學分數，達該學期修習學分總數三分之二者；惟身心障礙學生不受此限。\n四、進修部學生學期學業成績不及格科目之學分數，連續兩學期達各該學期修習學分總數三分之二者；惟身心障礙學生不受此限。\n五、延長修業期限屆滿，仍未符合第四十二條畢業條件者。\n六、未經本校同意，'}, 
       {'office':'教務處','group':'註冊組 Registration Section','sort':'其他問題 Other Questions','que':'請問要辦理休學要準備什麼東西，如何辦理？','ans':'1. 請攜學生證親至註冊組填寫相關表單，持高捷一卡通學生證者，如學生證尚有儲值，請先行至各捷運站辦理退費。\n2. 如未滿二十歲，須至少一位家長陪同。'}, 
       {'office':'教務處','group':'課務組 Curriculum Section','sort':'選課Q&A','que':'新生選課常見問題','ans':'請點擊連結查看說明：https://d002.wzu.edu.tw/datas/upload/files/Course/107COURSE-Q&A.pdf'}, 
       {'office':'教務處','group':'課務組 Curriculum Section','sort':'選課Q&A','que':'FAQ for Course Enrollment','ans':'請點擊連結查看說明：https://d002.wzu.edu.tw/datas/upload/files/Course/Q&A_E.pdf'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'英/外語能力診斷輔導中心(LDCC)在哪裡？','ans':'露德樓2F & 3F。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'診斷與諮商有何不同？','ans':'診斷－初診：教師施行語言學習風格策略之診斷與分析；複診：針對聽、說、讀、寫、發音、文法、單字等進行，為您量身訂作一套語言學習精進計畫。\n諮商－在您實踐個人學習計畫時(包括使用處方籤時)遇到任何問題，皆可尋求老師之協助。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'什麼是處方籤？一定要有處方籤才可享用服務嗎？','ans':'處方籤＝老師所開設之學習課程；但大專英檢已達240分以上者，基本上不需處方籤即可使用服務；可依照老師建議之處方籤內容學習，或可自行安排個人學習課程。\n處方籤項目包括：一、教師輔導療程：口語、簡報、詩歌、寫作、閱讀。二、主題式口語練習。三、自學軟體、補充教材。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'使用中心的服務是否皆須預約？','ans':'是的，所有項目皆請同學線上預約。教師/小老師輔導療程請於七天前完成預約；口語小老師至少須於二天前預約完成，且不提供當場預約。自學軟體等療程，若需當天預約請洽中心人員確認是否尚有名額。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'我為什麼不能預約中心的服務項目？','ans':'請先確認您成功註冊Dr. E-Learning多國語診斷諮商平台(包括確認個人基本資料、填寫學習風格與學習策略二份問卷等）。不會操作請看這裡。若依然無法使用，請聯絡中心(電話：(07)342-6031分機7403)。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'預約的軟體顯示地點為露德樓2F，到了預約時段是否逕自到二樓使用即可？','ans':'不是的。凡使用中心提供的服務皆請先到三樓(G326)告知中心人員並報到後，方得進入二樓場地使用。預約自學軟體報到的同時，請先向櫃台索取個人資料袋及軟體記錄表，以利紀錄該次使用狀況及進度。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'為什麼我不能預約教師/小老師口語練習或使用自學軟體等項目呢？','ans':'Dr. E-Learning多國語診斷諮商－英語療程系統，以大學英檢240分作為是否自由開放預約軟體及練口語權限為標準，因此無大學英檢成績或成績低於240分以下的同學，請先預約老師「診斷」，請老師依照個人學習需求開立口語練習及自學軟體處方箋，方得使用這些處方籤服務。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'口語練習之主題為何？','ans':'中心軟體Issues in English I &II 共有16個主題、中心製作之口語練習主題Conversation Topics及My ET 主題11類 (其每位學生皆可於教務資訊系統安裝使用)。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'為什麼部分駐診老師/小老師班表上會在名字後加上-ELCC呢？有什麼特別的意思嗎？','ans':'加上英文縮寫是為了區別執行地點：\n‧未加者：在英/外語能力診斷輔導中心(露德樓3樓，G326)\n‧加上ELCC：在歐亞能力診斷輔導中心(露德樓1樓)。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'臨時有事想取消當日的預約，看起來好像成功了，卻接到中心人員未出席的通知，怎麼會這樣？','ans':'同學沒有取消當日預約的權限亦不建議這麼做，若有需要取消當日預約，請電洽或親洽中心人員為您取消。'}, 
       {'office':'教務處','group':'英/外語能力診斷輔導中心','sort':'','que':'MyET自學網無法登入/帳號密碼錯誤/查無此帳號密碼?','ans':'伺服器請選擇「台灣」>「高雄市」>「文藻外語大學」\n並輸入資訊服務入口網之學號與密碼方可登入\n若有相關問題請來信至: aa85@mail.wzu.edu.tw 或親洽中心詢問'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'如何申請住宿及繳費？','ans':'新生宿舍申請流程步驟：進入校務資訊系統網站（http://sso.wzu.edu.tw/）/校務資訊系統〈帳號為學號，密碼為身分證字號(英文字母大寫)〉 / 選擇「登錄」 / 學務申請作業 / 學生宿舍申請作業 / 選擇所屬群組後，填入申請所需資料 / 資料送出，申請完成後，可將申請單列印自行存證。\n繳費規定：\n新生：新生住宿生上網申請床位，確認可住宿後於註冊時現場領取住宿繳費單，並於註冊現場繳交保證金與住宿費，再將繳費收據交至學生宿務組 / 住宿申請及繳費作業結束。\n舊生：舊生正取住宿生 / 由會計'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'需具備何種條件，方能住進學生宿舍？','ans':'專科部一年級新生，以戶籍為標準，凡當日無法通學者，均可上網路登記申請住宿；大學部一年級新生同樣以戶籍為標準，凡當日無法通學者，均可上網路登記申請住宿，唯床位不足時，經電腦篩選後決定之。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'宿舍信件要寄到哪裡？宿舍領取信件需注意事項？','ans':'學生宿舍地址：高雄市三民區民族一路900號。\n『信封』須註明『學生宿舍、房號、床號』\n一般信件：女生至B1電梯對面各樓層的信箱自取；男生至B1辦公室屏風後的信件盒中自取。\n掛號信件：請於每日16：30後至宿舍公佈欄查看並攜帶學生證到辦公室或民族路警衛室簽收領取。【寒(暑)假期間未申請住宿同學之掛號郵件等一律退回原址】。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'宿舍聯絡電話有那些？','ans':'宿舍專線：0972-259939、總機：(07)342-6031轉分機2251、2253。家長找同學只可留話請同學回電。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'住宿保證金的用途是什麼？','ans':'若在宿舍毀損公物、離宿時未清理乾淨、寢室鑰匙未繳回與違反舍團體生活公約時，將視程度扣保證金500~1,000 元。若無以上之情形，得於學年(兩個學期)結束時無息退款至個人帳戶，但若於期中自動退宿或中途被強制退宿時，保證金將不予退還。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'非住宿生能不能進來宿舍？家長能不能進來宿舍？請人家幫忙修電腦能不能進來？','ans':'1.非住宿生不能進入宿舍，若經發現住宿生及非住宿生皆記小過乙次，住宿生隨即勒令退宿。\n2.除期初遷入及期末遷出家長可進入宿舍寢室，其餘時間探望子女皆在B1會客室會面。\n3.請外人幫忙修電腦，請修繕者至辦公室登記並將電腦搬至B1辦公室。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'門禁是幾點鐘？如果超過門禁時間可以回宿舍嗎？','ans':'1.五專低年級週一至週四門禁為19：30，週五~日為22：30，大學部及專科部高年級門禁為23：00。\n2.若超過門禁時間30分鐘內是可以回宿舍的，但需先通知辦公室值班老師，且扣點處分；經常逾時返宿且不聽從師長勸告改善者，將通知家長並勒令退宿。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'東西壞了怎麼辦？如何申請修理？我要賠錢嗎？','ans':'1.寢室設備損壞時，住宿生請自行上網填寫修繕申請，問題即可以獲得迅速處理。\n2.宿舍設施非正常損壞或設施損壞未經申修處理者，應照價賠償。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'心愛的寵物如狗、猫、鼠、魚、龜…等，我可以帶來宿舍嗎？','ans':'為維護公共衛生與安全，在寢室內不得飼養寵物。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'什麼是寧靜時間？在這個時間內應注意什麼事情？','ans':'每日中午12：00~13：00、19：30~21：30（專科部晚自習）及23：00 ~翌日清晨06：30為寧靜時間，宿舍應保持寧靜以免干擾他人，故應遵守下列規定：\n1.保持寧靜，嚴禁於宿舍內大聲喧嘩。\n2.嚴禁在公共區域講電話，若需講電話，請至B1，並控制音量；若要使用吹風機需至晒衣間關門使用。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'要到什麼地方去查詢加扣點的紀錄？多少點會被記申誡及嘉獎？','ans':'1.登錄校務資訊系統→校務資訊→查詢→學務資訊查詢→住宿生加口點資料查詢。\n2.內外務不合格及違規扣點達15點時記申誡一次，表現優良加點達20點時記嘉獎一次。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'要如何申請外宿？申請外宿還有其相關規定嗎？如果臨時要申請外宿該怎麼辦？如何取消申請外宿？','ans':'1.外宿若為週五至週日時，統一於週日~週三24：00前上網登錄（登錄校務資訊系統→申請→學務申請作業→住宿生外宿請假申請作業）申請外宿；銷假時間為返宿當日刷卡銷假。\n2.若翌日為非假日或週三未辦理週末外宿時，須請家長來電告知宿舍值班老師後，再依外宿程序辦理。\n3.若申請外宿後未外宿，請於申請外宿當天點名前至辦公室辦理銷假。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'為什麼已申請外宿了還會被扣點？','ans':'可能的原因有：\n1.上網申請外宿後未按送出。\n2.未準時於星期三24：00前申請外宿。\n3.大學部平日外宿（星期一~星期四）只上網申請未來電申請電話外宿；專科部只請家長來電請假本人未至辦公室確認。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'宿舍問題Q&A','que':'若已申請退宿，但繳費單上仍有住宿費時，應怎麼辦呢？','ans':'可依以下方法解決：\n1.重新至校務資訊系統重新列印。\n2.至ATM轉帳繳交學雜費（扣除住宿費）即可。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役資料填報程序','que':'兵役資料填報程序','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136034'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'學生兵役緩徵（儘後召集）辦理作業程序','que':'學生兵役緩徵（儘後召集）辦理作業程序','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136074'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'學生緩徵作業流程','que':'學生緩徵作業流程','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136082'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'學生儘召作業流程','que':'學生儘召作業流程','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136102'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男出國作業','que':'役男出國作業流程','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/ezcatfiles/c012/img/img/1971/mil0006.pdf'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男出國作業','que':'出國申請表','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136110'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男出國作業','que':'出國申請流程圖','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/ezcatfiles/c012/img/img/1971/856417886.pdf'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男須知','que':'學生緩徵、儘後召集作業要點','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/ezcatfiles/c012/img/img/1971/mil0009.pdf'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男須知','que':'申請二階段常備兵役軍事訓練須知','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/ezcatfiles/c012/img/img/1971/mil0010.pdf'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男須知','que':'申請服一般替代役相關作業規定','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/ezcatfiles/c012/img/img/1971/mil0011.pdf'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'役男須知','que':'兵役調查表','ans':'請點擊連結查看說明：https://c012.wzu.edu.tw/category/136120'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役問題Q&A','que':'男生有關兵役部份，在新生註冊時要交什麼資料？','ans':'1.未服役學生，需填繳乙份「兵役調查表」，由文藻首頁→資訊服務入口網→校務資訊系統→登錄→學務登錄作業→新生資料調查作業→兵役調查表→列印。\n2.已服役學生：除繳交乙份「兵役調查表」外，另繳退伍令影本乙份。\n3.免役體位學生：繳交免役體位證明書影本乙份。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役問題Q&A','que':'男生在學期間如何申請緩徵或儘後召集？','ans':'1.未役男生屆齡19歲當年，即由學校主動辦理，將學生緩徵申請名冊函送各學生戶籍所在地縣市政府辦理緩徵。\n2.役畢學生：由學校主動辦理儘後召集，將申請名冊函送各學生戶籍所在地後備指揮部辦理儘後召集。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役問題Q&A','que':'學生中途遇休、退學、復學時，怎麼辦兵役？','ans':'1.休退學：學生辦妥休、退學離校後一個月內，由學校主動辦理緩徵原因消滅，\n將申請名冊函送各學生戶籍所在地縣市政府註銷緩徵。休學期間就由縣市政府管制。\n2.復學生：復學時須重新填報「兵役調查表」向生輔組兵役承辦人申請辦理，完成註冊後，由學校重新申請緩徵。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役問題Q&A','que':'學生在學期間、遇兵役身家調查或身體檢查時要怎麼辦？','ans':'1.身家調查：可由家屬或代理人，將所需核驗資料（學生證、身分證等）送兵役單位辦理。\n2.身體檢查：因須本人親自接受體檢，可以請公假前往（視體檢地點交通往返時間，給予半天或一天公假），指導單位由生輔組核章。\n3.遠道縣市接獲體檢通知單後可協調原發通知單位，能否學校就近體檢單位檢查。（節省往返時間及旅費）。'}, 
       {'office':'學生事務處','group':'軍訓室','sort':'兵役問題Q&A','que':'學生在學期間，兵役基本資料如有異動時要怎麼辦？','ans':'1.男生在學期間如姓名、戶籍地址有改變時，除向教務處註冊組申請更正個人基本資料外，並須至生輔組告知兵役承辦人。俾便爾後兵役後續作業。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'大專校院弱勢學生助學計畫─弱勢助學金問與答','que':'助學金申請時間如何？需準備什麼資料？','ans':'助學金一學年只開放申請1 次，請在第1 學期開學後至10 月14 日止，檢附申請暨切結書(請上網登錄資料後列印並簽名)及新式戶口名簿或戶籍謄本(三個月內)繳交至生活輔導組。如僅上網登錄申請資料，未列印或未繳交完整資料，視同未申請。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'大專校院弱勢學生助學計畫─弱勢助學金問與答','que':'要怎麼知道助學金開放申請了？','ans':'本校每年均透過學號e-mail 信箱(學生信箱)、網路公告、助學措施座談會、班級群組、幹部訓練、導師座談會、文宣傳單等多種管道進行宣導，請留意相關資訊。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'大專校院弱勢學生助學計畫─弱勢助學金問與答','que':'我與家人的戶籍不在同一個地址，可以申請助學金嗎？是否會影響到家戶經濟條件的計算？','ans':'申請所列計之家庭成員是以親屬關係而非戶籍關係認定，即學生本人、學生父母(如雙親離異，則僅列計監護人) 或學生本人、學生配偶(已婚者)，家庭成員即使不同戶籍，仍需認列。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'大專校院弱勢學生助學計畫─弱勢助學金問與答','que':'我家人有農、漁會會員資格，可以申請農委會獎學金，但是家庭經濟狀況也符合助學金的條件，我也可以申請助學金嗎？','ans':'農委會(全稱為行政院農業委員會)獎學金與助學金僅得擇一申請，一經申請即無法取消。農委會獎學金為每學期申請 1 次，申請學生請就個別家庭經濟條件估量何者為優，請在申請前考慮清楚。（相關辦法可以至圓夢助學網查看相關法規）'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'政府為什麼要開辦就學貸款？','ans':'為協助中低收入家庭子女就學，減輕其籌措教育經費之負擔，使子女能安心就學，完成學業。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就貸要到哪家銀行辦？','ans':'教育部規定：在高雄市地區的學校是由高雄銀行負責承貸，所以本校學生要辦就貸要到高雄銀行及 其各地分行辦理（可由高雄銀行就學貸款網頁 https://ssl.bok.com.tw/member/ 查看）。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款申請流程為何？','ans':'1.於高雄銀行網站填列「就學貸款申請/撥款通知書」一式三份。\n2.保證人及學生攜帶必要證件、資料(印章、身分證、戶籍謄本現戶全戶詳細記事正本)至高雄銀行各分行辦理對保。\n3.對保後於學校校務資訊網登錄個人就學貸款資料並列印。\n4.開學後 3 日內將高雄銀行撥款通知書、就學貸款申請表、戶籍謄本現戶全戶詳細記事影本繳回生活輔導組。\n5.學校將學生申貸資料上傳教育部轉財稅資料中心查核標準等級。\n6.財稅資料中心回覆審查結果。\n7.學校依審查結果，將合於申貸學生分類造冊函送承貸銀行辦理核撥貸款。（如僅完成銀行對'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就貸申請標準為何？','ans':'學生本人及家長（或監護人）、本人及配偶前一年度綜合所得總額為新臺幣 120 萬元以下目前標準如下：\nA 級：家庭年收入在 114 萬以內者。在學就讀期間利息由政府全額補助。\nB 級：家庭年收入在 114 萬~120 萬者。在學就讀期間利息由政府補助半數，自付半數。\nC 級：家庭年收入在 120 萬以上者，如家中僅有乙名子女就讀高中職以上學校者，則不符申請標準；如家中有二名子女就讀國內高中（職）以上學校者，始可辦理貸款。如家庭經濟或其他特殊情況有困難學生，經學校認定有必要者，依實際狀況給予協助辦理就學貸'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'如果財稅資料中心審查結果為 B、C 類，要如何處理？','ans':'屬 B 類：且願意續貸者，應填繳乙份「就學貸款半額負擔切結書」。\n屬 C 類：1.如家中僅有乙名子女就讀高中、職以上學校者，依規定就不可以貸款。但如有特殊原因，經學校審核通過，方可提出申請。\n2.如家中有 2 名以上子女就讀高中、職以上學校，可申請辦理就學貸款，但需填繳「就學貸款全額負擔切結書」及另一名兄弟姐妹學生證正反影本乙份。屬 B、C 類不願繼續貸款者，由學校註銷就貸資料，並於規定時間內至總務處出納組補繳學雜費。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款可貸哪些項目與金額？','ans':'1.學雜費：依學校規定費用（含教育學程學分費）。\n2.學生平安保險費：依學校規定費用。\n3.住宿費：住宿校內外者，依學校規定費用（不含膳食費）。\n4.書籍費：依教育部規定，金額最高不得超過 3,000 元。\n5.海外研修費：限「學海飛颺」、「學海惜珠」獲獎之學生及雙聯學制之學生，每學年以 44 萬元為上限。(專案申請)\n6.生活費：低收入戶學生，每學期4 萬元上限；中低收入戶學生，每學期 2 萬元上限。(生活費貸款須由生輔組另外開立證明)\n以上 3、4、5、6 項可依需要自行向銀行要求申貸，俟銀行審核後'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'已享有政府給與學雜費減免、或其他補助，是否還可以申請就學貸款？','ans':'可以。但僅能貸款扣除享有學雜費減免及補助之差額。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款可不可以申貸生活費？','ans':'僅限具低收入戶、中低收入戶資格學生可以申請，低收入戶學生每學期 4 萬元，中低收入戶學生每學期 2 萬元。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'有申貸校外租屋費、書籍費或生活費如何退費？','ans':'經財稅資料中心資格審查回覆後，視審查結果，彙整退費資料，經與會計室核對退費金額無誤後，符合退費學生，退款直接匯至學生帳戶，(生活費退費於開學第 6 週；住宿費、書籍費退費約在開學第 12 週)。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'何謂對保？','ans':'學生向銀行表達申貸之意願，保證人願為申貸學生作保，並遵銀行所提供之申請書借據上簽名以示負責。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'何時辦理對保？','ans':'銀行受理對保時間：\n1.第一學期：每年 8 月 01 日至 開學後三日內（依學校公告之收件截止時間為準）。\n2.第二學期：每年 1 月 15 日至 開學後三日內（依學校公告之收件截止時間為準）。\n學校收件截止時間：每學期開學後三日內，應將資料（文藻就貸申請表/撥款通知書及戶籍謄本詳細記事）繳交至生輔組。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'新生註冊前，承貸銀行尚未開始受理對保作業，要如何辦理就學貸款申請？','ans':'先不用繳交學雜費，俟承貸銀行開始受理就學貸款後，持繳費註冊單去高雄銀行辦理就貸對保手續，開學三日內需將就文藻學貸款申請表/撥款通知書及戶籍謄本影本繳交至生輔組才算完成就貸程序，否則視為未完成就學貸款，應另補繳學雜費用。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'辦理對保時，應攜帶哪些資料證件？','ans':'1.高雄銀行網站線上填妥之就學貸款申請/撥款通知書及有關資料。\n2.學生證正本及其正、反面影本乙份。\n3.學雜費繳費單。\n4.學生與保證人之印章及身分證影本各乙份。\n5.學生本人及保證人之三個月內戶籍謄本乙份（如戶籍不同者，需分別檢附），同一教育階段第二次申辦者免再繳。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'對保時父母親（監護人）要不要去？','ans':'1.學生未滿 20 歲者，第一次父母或監護人都要陪同去；已滿 20 歲者父母或監護人可只去一位，也可擇親友一人為保證人，惟需附在職或薪資證明。同一教育階段第二次以後申辦，保證人就可以不用陪同。\n2.保證人如因身在國外、重病、失蹤或因案入獄服刑無法到場者，需檢附印鑑證明書、重病證明、失蹤報案或服監證明。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'對保後，如何上校務資訊網登錄個人就學貸款資料？','ans':'就學貸款申請表登錄路徑：資訊服務入口網→登入校務資訊系統→申請→學務申請作業→就學貸款申請作業→資料登錄→存檔→列印紙本申請表。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'登錄就學貸款申請表時，應注意哪些事項？','ans':'1.戶籍地址是否正確，如有變更，需至教務處註冊組申請異動。\n2.預定畢業時間要正確。\n3.父母親屬性（存、歿、離、監護）應正確填寫，事關家庭所得計算標準。\n4.貸款總金額須與申請/撥款通知書上所填金額相符。另住宿費、書籍費、減免金額各欄，依實填寫，俾便核對。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'延修生如何申請就學貸款？','ans':'在確認重補修學分數後，即可至會計室開具繳費單或直接到生輔組找承辦人員，再至高雄銀行辦理就學貸款。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'已辦妥就貸對保後，又因學分數異動而需更改應繳學雜費，如何修改就學貸款金額？','ans':'1.先至會計室確定加修後之繳費單並列印乙份。\n2.攜帶身分證、印章至生活輔導組，取回已繳之就貸申請/撥款通知書，連同自存的乙聯，至高雄銀行北高雄分行（民族 一路 1012 號榮總附近）辦理更改作業。\n3.修正後將就貸申請/撥款通知書交回生活輔導組，登錄修改金額。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'交換學生出國半年以上學生，隔一學期就貸如何辦理？','ans':'出國前至生輔組辦理人工貸款，惟第二次之貸款金額欄先空白，上網查下一學期之繳費費單後，\n1.請同學至銀行網站填寫貸款資料，請保證人(家人)將人工貸款資料郵寄至銀行。\n2.至校內系統登陸就學貸款資料。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'休、退學生轉至他校就讀學生，就學貸款要注意哪些事項？','ans':'休、退學生轉至他校就讀，因原來在高雄銀行貸款紀錄仍然存在，所以、同學在新就讀學校完成註冊後，將學生證影印乙份，另填寫乙份「就學貸款緩繳本金申請暨切結書」(高雄銀行網站下載)併寄至高雄銀行前金分行，\n地址：801 高雄市前金區六合二路145 號 3F，聯絡電話：07-2863358＃13，俾便保留暫緩還款。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款何時償還？償還期限','ans':'1.於最後教育階段學業完成（或服完義務兵役、替代役或教育實習期滿）後滿一年之日，開始按月分期攤還本息。\n2.因故退、休學，應主動至銀行辦理延期償還申請，未繼續升學者，應於退學或休學滿一年之日起開始償還。\n3.參加教育實習者，得至實習期滿後，滿一年之日起開始償還。\n4.出國留學、就業、定居者，應於出國前一次償還。\n5.在職專班者，應自簽訂借據當時教育階段學程學業完成日（如未繼續升學者）之次日起、或自最後教育階段學程學業 完成日（如繼續在國內升學者）之次日起，開始攤還本息。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款如何還款？','ans':'1.依高雄銀行通知，按期赴高雄銀行及其各地分行營業部門繳款。\n2.請向高雄銀行申請活儲帳戶，辦理自動轉帳手續，既便捷又不會造成利息損失。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生就學貸款─問與答','que':'就學貸款承辦單位及聯絡電話。','ans':'1.日間部：學生事務處生活輔導組（07）-3426031＃2212\n2.進修部：進修部總務組（07）-3426031＃3131'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'學雜費減免之申請資格?','ans':'(一)本校五專、四技、二技及碩士班之在學學生，具軍公教遺族子女、現役軍人子女、原住民學生、低收入户學生、中低收入户學生、身心障礙學生、身障人士子女及特殊境遇家庭子女等身分者均可申請。\n(二)教育部學雜費減免，除身心障礙學生外均以法定修業年限為限，不包括延長修業年限、暑期(重)補修之學分費。\n(三)在同一學期已申請過就學減免費用之學生，如有復學、轉學(如大 2 轉大 2 或大 2 休學後復學大 2)等情形不得重複申請。學生在學期中辦理休/退學當學期已申請之减免費用不予追繳；但復學後或再行入學時，'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'各項身分減免額度?','ans':'(一)現役軍人子女：學費或學分費減免 3/10(不含雜費、保險費及實習費)\n(二)原住民學生：依教育部訂定標準定額滅免\n(三)低收入户學生：學雜費全免、平保費\n(四)中低收入户學生：學雜費減免 6/10\n(五)極、重度身心障礙學生或殘障人土士子女：學雜費全免、平保費n(六)中度身心障礙學生或殘障人士子女：學、雜費減免 7/10\n(七)輕度身心障礙學生或殘障人土子女：學、雜費減免 4/10\n(八)軍公教遺族子女：依教育部規定標準定額減免\n(九)特殊境遇家庭之子女：學雜費減免百分之 6/10'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'何謂低收入戶學生、中低收入戶學生及特殊境遇家庭子女？','ans':'低收入戶學生、中低收入戶及特殊境遇家庭子女身分認定，由各學生戶籍地，縣、市、鄉、鎮、區公所核定。符合資格者，鄉區公所會發給證明或政府公函，證明文件內須有學生名字及身分證字號。又，一般村、里長開具的清寒證明，不具申請學雜費減免效力。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'政府獎助學金種類很多,已申請學雜費減免後是否還可以申請其他補助?','ans':'僅能擇 1 申請。政府的相關獎補助如：教育部弱勢助學金、農漁民子女獎助學金、軍教子女教育補助費、原住民子女獎助學金、勞工局勞工子女助學金、失業勞工子女就學補助金、受刑人子女助學金、榮民子女助學金等、法務部被害人子女助學金等，僅能擇 1 申請，不得重複。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'申請身心障礙學生及身心障礙人士子女減免，家庭年所得總額不得超過新台幣 220 萬元，其計算方式為何?','ans':'(一)學生未婚者\n1.未成年：與父母或法定監護人合計之家庭所得總額(含薪資、利息等各項所得)。\n2.己成年：與父母合計之家庭所得總額(含薪資、利息等各項所得)。\n(二)學生已婚者，為其與配偶合計之家庭所得總額(含薪資、利息等各項所得)。\n(三)學生離婚或配偶死亡者，只計算學生本人所得。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'註冊繳費後才新取得符合學雜費滅免申請資格，可以補辦理嗎?','ans':'可以。請於註冊日至開學後三週內，親洽學務處生輔組承辦人員辦理。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'需先辦理學雜費減免或先到高雄銀行辦理就學貸款?','ans':'欲申辦就學貸款需先辦理學雜費減免，再持減免後之註冊繳費單至高雄銀行辦理就學貸款。'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'就學減免(學雜費)─問與答','que':'學雜費減免承辦窗口','ans':'日間部：學務處生輔組 電話 07-3426031 分機 2212\n進修部：進修部學務組 電話 07-3426031 分機 3122'}, 
       {'office':'學生事務處','group':'生活輔導組','sort':'學生操行事宜、勤缺獎懲─問與答','que':'學生操行事宜、勤缺獎懲─問與答','ans':'請點擊連結查看詳細說明：https://reurl.cc/Ag19eE'}

        ]
     
def get_res(restaurant):   
    res_info=[]
    
    for i in  qa_db:
        if i['r_name'].find(restaurant) != -1 :
            res_info.append(i)            
            #break
       
    return(res_info)
# area='左營'

def area_res(area):
    res_info=[]
    
    for i in  qa_db:
        if i['add'].find(area) != -1 :
            res_info.append(i) 
                   
    return(res_info)
    
def sort(sort):
    qa_info=[]
    
    for i in  qa_db:
        if i['sort'].find(sort) != -1 :
            qa_info.append(i)  
                   
    return(qa_info)
    